/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "再試一次";
CancelButtonTitle = "取消";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> 因為無法讀取下列檔案：「/Users/Shared/HP/HP Event Store/HPEventStore.hpstore」。";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> 因為找不到以下檔案:“/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "如果您已移動或刪除「HPEventStore.hpstore」檔案，請將其取代，然後按一下「再試一次」。\r若要建立新檔案，請按一下「建立」。";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "建立";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> 因為應用程式無法存取以下檔案:“/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "修復存取";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "檢查上層檔案夾「HPEventStore.hpstore」，確保其未被鎖定，且權限設定為「讀取與寫入」，然後按一下「再試一次」。\r若要使應用程式嘗試修復權限，請按一下「修復存取」。";

//Error description for out of disk space error
DiskFullErrorDescription = "啟動磁碟空間不足，無法完成 <OPERATION> 作業。";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "從磁碟中移除一些檔案，然後按一下「再試一次」。";
